<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"12158324d58eeccbbaaf73164133c9cc14219a5c58adde13673ec684bd6a9c34","plan_job_ref":"Job Create terraform plan #13 at https://github.com/leonitousconforti/infra/actions/runs/15418931665","plan_out_hash":"d8c68e13d5b74378648d75e692fa4b78dcde0c58e48afff408bc0031ad767151","plan_hash":"c5272de93855ecb57ceb1546c69a87f1c1e066e13e8e22bdd906bfdd49d1d611","plan_text_format":"diff","version":"2.0.0"} -->
Terraform plan in __ltgk.net__<details open><summary>With variables</summary>

```hcl
do_token           = (sensitive value)
porkbun_api_key    = (sensitive value)
porkbun_secret_key = (sensitive value)
```
</details>
<details>
<summary>Plan: 10 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # digitalocean_domain.ltgk_net will be created
+   resource "digitalocean_domain" "ltgk_net" {
+       id   = (known after apply)
+       name = "ltgk.net"
+       ttl  = (known after apply)
+       urn  = (known after apply)
    }

  # digitalocean_project_resources.ltgk_net_project will be created
+   resource "digitalocean_project_resources" "ltgk_net_project" {
+       id        = (known after apply)
+       project   = "acf5abcc-4976-4233-9832-7c7ca3efea5a"
+       resources = (known after apply)
    }

  # digitalocean_record.dmarc will be created
+   resource "digitalocean_record" "dmarc" {
+       domain = "ltgk.net"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "_dmarc"
+       ttl    = 300
+       type   = "TXT"
+       value  = "v=DMARC1; p=quarantine; rua=mailto:25f8c5e6@mxtoolbox.dmarc-report.com; ruf=mailto:25f8c5e6@forensics.dmarc-report.com; fo=1"
    }

  # digitalocean_record.domainkey will be created
+   resource "digitalocean_record" "domainkey" {
+       domain = "ltgk.net"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "default._domainkey"
+       ttl    = 300
+       type   = "TXT"
+       value  = "v=DKIM1; k=rsa; p=MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQC8158yxaFjZYq/gcbZ9pfsLcq7pkABLfl8q1AXWbAMpgZSUdpw1o/CKSHmVpnYL9pwLTYvLxpN9W8DkO5lSRFWxP/ljKCX/rJzSJ28MwI7UuPjbWpG43/zdIJc9yUP8F9ulmumnVinMEvQPVW49u1RPSDeCovTMWCrLXeRrRE86wIDAQAB"
    }

  # digitalocean_record.mx1 will be created
+   resource "digitalocean_record" "mx1" {
+       domain   = "ltgk.net"
+       fqdn     = (known after apply)
+       id       = (known after apply)
+       name     = "@"
+       priority = 10
+       ttl      = 600
+       type     = "MX"
+       value    = "fwd1.porkbun.com"
    }

  # digitalocean_record.mx2 will be created
+   resource "digitalocean_record" "mx2" {
+       domain   = "ltgk.net"
+       fqdn     = (known after apply)
+       id       = (known after apply)
+       name     = "@"
+       priority = 20
+       ttl      = 600
+       type     = "MX"
+       value    = "fwd2.porkbun.com"
    }

  # digitalocean_record.ns1 will be created
+   resource "digitalocean_record" "ns1" {
+       domain = "ltgk.net"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "ltgk.net"
+       ttl    = 1800
+       type   = "NS"
+       value  = "ns1.digitalocean.com"
    }

  # digitalocean_record.ns2 will be created
+   resource "digitalocean_record" "ns2" {
+       domain = "ltgk.net"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "ltgk.net"
+       ttl    = 1800
+       type   = "NS"
+       value  = "ns2.digitalocean.com"
    }

  # digitalocean_record.ns3 will be created
+   resource "digitalocean_record" "ns3" {
+       domain = "ltgk.net"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "ltgk.net"
+       ttl    = 1800
+       type   = "NS"
+       value  = "ns3.digitalocean.com"
    }

  # digitalocean_record.sfp will be created
+   resource "digitalocean_record" "sfp" {
+       domain = "ltgk.net"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "@"
+       ttl    = 300
+       type   = "TXT"
+       value  = "v=spf1 include:_spf.porkbun.com ~all"
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #13](https://github.com/leonitousconforti/infra/actions/runs/15418931665)